thieryus007-cloud/xiao-door/nRF54LM20A/xiao_door_sensor/src/main.c
/*
 * Pivot d'architecture (2026-08-28) -- System ON IDLE + GRTC, plus de
 * reboot par cycle. Voir XIAO-nRF54LM20A-Solution-System-OFF.md, § "Pivot
 * d'architecture" : le plancher mesure de l'ancienne strategie (System OFF
 * + redemarrage complet a chaque sondage, tests #22-31) etait ~70-144 uA,
 * structurellement incompressible (reinit MFD/regulateur/BLE a chaque
 * reboot). Remplacee par une boucle main() infinie (CONFIG_PM=y, k_sleep()
 * entre cycles) : le SoC ne redemarre plus jamais tant que l'appareil reste
 * alimente -- plancher datasheet documente 4,3 uA (System ON IDLE + GRTC
 * XOSC + 512 KB RAM retenue, page 1 du datasheet Nordic), architecture
 * identique au projet frere nRF52840 (~10 uA mesures, reveil IMU inclus).
 *
 * Consequence directe pour l'IMU (sample_motion()) : imu_vdd/LDO1 est
 * toujours coupe/rallume a chaque cycle (son cout ~250-300 uA en continu
 * reste confirme, voir meme document), mais le SoC ne reinitialise plus
 * son etat RAM entre deux cycles. device_init(imu_dev) ne se re-execute
 * donc plus qu'une seule fois (kernel/device.c: z_impl_device_init()
 * renvoie -EALREADY sans rappeler dev->ops.init() si dev->state->initialized
 * est deja vrai) alors que la puce physique, elle, perd son etat de
 * configuration a chaque coupure de imu_vdd. sample_motion() reecrit donc
 * explicitement par I2C, a CHAQUE cycle, les deux registres que
 * lsm6dsl_init_chip() ne configure qu'au tout premier appel (CTRL3_C:
 * BDU+IF_INC : lsm6dsl.c:778-785 ; CTRL6_C: XL_HM_MODE bas-consommation :
 * lsm6dsl.c:788-793) -- sans quoi les lectures X/Y/Z deviendraient
 * incoherentes en silence a partir du 2e cycle.
 *
 * Elements System OFF conserves tels quels (n'ont rien a voir avec le
 * mode d'alimentation du SoC) : LED deconnectees, flash SPI externe
 * suspendu (driver + bus + broches GPIO brutes), regulateurs
 * power_en/LDO1 sans regulator-boot-on (sauf imu_vdd, voir overlay).
 * Console DESACTIVEE EN DUR (CONFIG_SERIAL=n), jamais suspendue a
 * l'execution (bug driver UARTE documente, voir prj.conf).
 *
 * Intervalle trame B : 15 min (valeur de production).
 *
 * Parite fonctionnelle production (2026-08-29) -- portage des trames A
 * (mouvement/orientation/bouton/tamper=0/vibration=0) et C (IMU brut)
 * depuis l'ancien firmware de reference (archive/xiao_door_sensor-logs-
 * et-backups/reference/main_full_2026-08-27.c.bak, toujours actif sur
 * l'unite #03) sur cette architecture System ON IDLE. L'ancien mecanisme
 * de reveil GPIO/System OFF (configure_imu_wakeup()/arm_gpio_wake(),
 * erratas [37]/[114]) n'est PAS porte : il n'a plus de raison d'etre, la
 * boucle sonde deja l'accelerometre en logiciel toutes les
 * MOTION_POLL_INTERVAL_MS sans jamais dormir en System OFF. Le journal de
 * diagnostic par cycle (diag_log_*) n'est pas porte non plus : il ne
 * servait qu'a diagnostiquer l'ancien cycle reboot-par-sondage, sans objet
 * ici. Le gyroscope reste allume uniquement en rafale (jamais en continu,
 * ~0,9 mA contre ~9 uA pour l'accelerometre seul), lu dans la meme fenetre
 * imu_vdd que l'accelerometre, juste avant de couper le rail -- voir
 * sample_motion(). Deux bugs corriges au passage : troncature de la
 * lecture accelerometre (x.val1 seul, sans x.val2 -- ecrasait ~9,8 m/s^2 en
 * 9, detruisait le seuil de mouvement 0,3 m/s^2) ; echeances GRTC absolues
 * (next_health_us/next_heartbeat_us) potentiellement obsoletes si la RAM
 * retenue (SRAM, pas RRAM) survit a un reset/reflash alors que le compteur
 * GRTC repart de zero -- desormais bornees a au plus un intervalle complet
 * apres le boot, voir main().
 *
 * Correctif H_LACTIVE (2026-09-01) -- CTRL3_C.H_LACTIVE=1 (bit 5) : INT1
 * devient actif bas, evite qu'il tire ~33 uA en continu entre l'ecriture
 * de CTRL3_C et la coupure du rail (INT1 flotte sinon vers son defaut
 * actif haut). Entre le 2026-09-01 et le 2026-09-22, ce correctif etait
 * present sur l'image deployee (golden-image/unit02-verified-2026-09-01-
 * H_LACTIVE.bin) mais obtenu par patch binaire d'un octet (offset 46096,
 * 0x44->0x46) plutot que par recompilation -- voir Procedure-Clonage-
 * XIAO-nRF54LM20A.md pour la methode historique, desormais obsolete :
 * applique ici directement dans le source (LSM6DSL_CTRL3_C_H_LACTIVE
 * ci-dessous).
 *
 * Reproductibilite du build (resolue le 2026-09-22, voir Plan-Reduction-
 * Consommation-2026-09-22.md §1) -- ce fichier, recompile tel quel,
 * reproduit octet pour octet l'image deployee ci-dessus (SHA-256
 * zephyr.bin attendu : 0da087ae45d087afdc334828e95a8c44283b1182b1cce5dc
 * 1525d7133853f778). Le "bug de reconstruction non reproductible" ouvert
 * aupres du support Nordic (Suivi-Nordic-Reproductibilite-Build-2026-
 * 09-19.md) n'existait pas : les rebuilds mesures a ~33 uA au lieu de
 * ~22 uA venaient d'un k_msleep(40) au lieu de k_msleep(6) dans
 * sample_motion() (commit ccbe1b5, +34 ms de rail imu_vdd allume par
 * cycle ~ +11 uA), introduit par erreur apres le flash de l'image d'or
 * du 2026-08-30, jamais d'une divergence reelle du compilateur --
 * `west build` (NCS 3.4.0, toolchain dcbdc366a1) est deterministe.
 *
 * Copyright (c) 2019 Nordic Semiconductor ASA
 * SPDX-License-Identifier: Apache-2.0
 */
#include <errno.h>
#include <inttypes.h>
#include <math.h>
#include <stdio.h>
#include <stdlib.h>
#include <zephyr/device.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/hwinfo.h>
#include <zephyr/drivers/i2c.h>
#include <zephyr/drivers/mfd/npm13xx.h>
#include <zephyr/drivers/regulator.h>
#include <zephyr/drivers/retained_mem.h>
#include <zephyr/drivers/sensor.h>
#include <zephyr/drivers/timer/nrf_grtc_timer.h>
#include <zephyr/kernel.h>
#include <ram_pwrdn.h>
#include <zephyr/pm/device.h>
#include <zephyr/sys/byteorder.h>
#include <zephyr/sys/crc.h>
#include <zephyr/sys/reboot.h>
#include <zephyr/bluetooth/bluetooth.h>
#include <zephyr/bluetooth/addr.h>

#define FRAME_B_INTERVAL_MS (15 * 60 * 1000)
#define ADV_BURST_MS         700

/* Sondage IMU a faible rapport cyclique (introduit test #22, conserve
 * dans le pivot System ON IDLE) : imu_vdd/LDO1 est allume brievement a
 * CHAQUE cycle de la boucle main(), le temps de lire un echantillon
 * accelerometre, puis eteint avant le k_sleep() suivant. Strategie
 * validee sur le projet frere nRF52840 Sense (sondage periodique, pas
 * d'interruption asynchrone) -- voir XIAO-nRF54LM20A-Solution-System-OFF.md.
 * imu_vdd/LDO1 confirme couter ~250-300 uA en continu quel que soit le
 * firmware (y compris le code de reference Seeed) ; l'objectif est de ne
 * payer ce cout que pendant une courte fenetre par cycle plutot qu'en
 * continu.
 *
 * Test #39 (2026-08-28) -- 1000 -> 1500 ms teste puis retire. Resultat
 * (fenetre PPK2 60 s, unite #01) : 15,87 uA / 951,92 uC a 1500 ms contre
 * 21,52 uA / 1,29 mC a 1000 ms -- confirme le modele "cout quasi fixe
 * par salve" (-26% de consommation pour -33% de frequence de sondage).
 * Revenu a 1000 ms sur decision explicite : reference nRF52840 Sense
 * (~10 uA, reactivite ~1 s) prioritaire sur le gain de consommation --
 * voir XIAO-nRF54LM20A-Solution-System-OFF.md. */
#define MOTION_POLL_INTERVAL_MS 1000

/* --- Logique evenementielle trame A, reprise telle quelle de l'ancien
 * firmware de reference (main_full_2026-08-27.c.bak) -- constantes
 * inchangees, toutes basees sur k_uptime_get() (horloge murale), donc
 * valables quelle que soit la cadence de sondage. --- */
#define FRAME_A_HEARTBEAT_MS     (60 * 60 * 1000)   /* heartbeat sans activite */
#define MOTION_REPORT_MIN_GAP_MS 4000               /* anti-rafale evenement */
#define FRAME_A_MAX_PER_MIN      10                 /* plafond glissant 60s */
#define MOTION_THRESHOLD_MS2     0.3f
#define ANGLE_HYSTERESIS_DD      20                 /* 2,0 deg en dixiemes */
#define REST_FRAME_DELAY_MS      10000              /* delai avant trame repos */
#define REST_FRAME_MAX_WAIT_MS   30000              /* filet de securite */
#define RAD_TO_DEG 57.29577951308232f

#define BTHOME_UUID_LO      0xD2
#define BTHOME_UUID_HI      0xFC
#define BTHOME_INFO_TRIG    0x44

#define OBJ_PACKET_ID       0x00
#define OBJ_BATTERY         0x01
#define OBJ_TEMPERATURE     0x02
#define OBJ_VOLTAGE         0x0C
#define OBJ_GENERIC_BOOL    0x0F
#define OBJ_BATTERY_LOW     0x15
#define OBJ_MOTION          0x21
#define OBJ_TAMPER          0x2B
#define OBJ_VIBRATION       0x2C
#define OBJ_BUTTON          0x3A
#define OBJ_ROTATION        0x3F
#define OBJ_ACCELERATION    0x51
#define OBJ_GYROSCOPE       0x52
#define OBJ_ACCEL_SIGNED    0x63

static const struct gpio_dt_spec led_red = GPIO_DT_SPEC_GET(DT_ALIAS(led1), gpios);
static const struct gpio_dt_spec led_blue = GPIO_DT_SPEC_GET(DT_ALIAS(led0), gpios);
static const struct gpio_dt_spec led_green = GPIO_DT_SPEC_GET(DT_ALIAS(led2), gpios);

