thieryus007-cloud/xiao-door/nRF54LM20A/xiao_door_sensor/src/main.c
#if DT_NODE_HAS_STATUS(DT_NODELABEL(py25q64), okay)
static const struct device *const flash_dev = DEVICE_DT_GET(DT_NODELABEL(py25q64));
static const struct device *const flash_bus = DEVICE_DT_GET(DT_BUS(DT_NODELABEL(py25q64)));
#endif

static const struct device *const charger_dev = DEVICE_DT_GET(DT_NODELABEL(pmic_charger));
static const struct device *const imu_dev = DEVICE_DT_GET(DT_ALIAS(imu0));
static const struct device *const pmic_dev = DEVICE_DT_GET(DT_NODELABEL(pmic));
static const struct device *const pmic_regs = DEVICE_DT_GET(DT_PARENT(DT_NODELABEL(imu_vdd)));

#define NPM13XX_LDSW_BASE     0x08
#define NPM13XX_LDSW_TASK1CLR 0x01

/* Acces I2C direct au LSM6DS3TR-C, independant du driver Zephyr --
 * necessaire pour reecrire CTRL3_C/CTRL6_C a chaque cycle (voir
 * commentaire d'en-tete de fichier). Registres pris dans
 * zephyr/drivers/sensor/st/lsm6dsl/lsm6dsl.h (prive au driver, non
 * inclus ici -- valeurs recopiees). */
static const struct i2c_dt_spec imu_i2c = I2C_DT_SPEC_GET(DT_ALIAS(imu0));

/* Bouton physique (sw0/button0, gpio0.9, PULL_UP|ACTIVE_LOW -- deja cable
 * au niveau materiel, cf. devicetree). Repris a l'identique de l'ancien
 * firmware de reference, y compris son bug connu non resolu (lit toujours
 * 0 en test reel, cause jamais trouvee, hors perimetre de ce portage --
 * l'objectif est la parite avec la production, pas la correction de ce
 * bug). GPIO_DT_SPEC_GET/gpio_pin_get_dt tiennent deja compte de la
 * polarite ACTIVE_LOW. */
static const struct gpio_dt_spec button = GPIO_DT_SPEC_GET(DT_ALIAS(sw0), gpios);

#define LSM6DSL_REG_CTRL3_C        0x12
#define LSM6DSL_CTRL3_C_BDU        BIT(6)
#define LSM6DSL_CTRL3_C_H_LACTIVE  BIT(5)
#define LSM6DSL_CTRL3_C_IF_INC     BIT(2)
#define LSM6DSL_REG_CTRL6_C        0x15
#define LSM6DSL_CTRL6_C_XL_HM_MODE BIT(4)
#define LSM6DSL_REG_CTRL1_XL   0x10
#define LSM6DSL_REG_OUTX_L_XL  0x28
#define CTRL1_XL_208HZ_2G      0x50   /* ODR_XL=0101, FS=+/-2 g */
#define ACCEL_MS2_PER_LSB      (61e-6f * 9.80665f)  /* 0,061 mg/LSB a +/-2 g */

static void print_reset_cause(uint32_t reset_cause)
{
	if (reset_cause & RESET_DEBUG) {
		printf("Reset by debugger.\n");
	} else if (reset_cause & RESET_CLOCK) {
		printf("Wakeup from System OFF by clock source.\n");
	} else if (reset_cause & RESET_LOW_POWER_WAKE) {
		printf("Wakeup from System OFF by GPIO.\n");
	} else if (reset_cause != 0U) {
		printf("Other wake up cause 0x%08" PRIX32 ".\n", reset_cause);
	} else {
		printf("Power-on reset or reset cause unavailable.\n");
	}
}

static void release_led(const struct gpio_dt_spec *led, const char *name)
{
	int rc;

	if (!gpio_is_ready_dt(led)) {
		return;
	}

	rc = gpio_pin_configure(led->port, led->pin, GPIO_DISCONNECTED);
	if (rc < 0) {
		printf("Warning: could not disconnect %s (%d)\n", name, rc);
	}
}

static void release_led_gpios(void)
{
	release_led(&led_red, "red LED");
	release_led(&led_blue, "blue LED");
	release_led(&led_green, "green LED");
}

/*
 * Put the external flash pins into deterministic, low-leakage states before
 * System OFF. These pin numbers are confirmed by the board pinctrl and DTS.
 */
static int configure_spi_pins_for_system_off(void)
{
	const struct device *gpio2 = DEVICE_DT_GET(DT_NODELABEL(gpio2));
	int rc;

	if (!device_is_ready(gpio2)) {
		printf("GPIO2 not ready.\n");
		return -ENODEV;
	}

	rc = gpio_pin_configure(gpio2, 5, GPIO_OUTPUT_HIGH);
	if (rc < 0) {
		return rc;
	}
	rc = gpio_pin_configure(gpio2, 0, GPIO_OUTPUT_HIGH);
	if (rc < 0) {
		return rc;
	}
	rc = gpio_pin_configure(gpio2, 3, GPIO_OUTPUT_HIGH);
	if (rc < 0) {
		return rc;
	}
	rc = gpio_pin_configure(gpio2, 1, GPIO_OUTPUT_LOW);
	if (rc < 0) {
		return rc;
	}
	rc = gpio_pin_configure(gpio2, 2, GPIO_OUTPUT_LOW);
	if (rc < 0) {
		return rc;
	}
	rc = gpio_pin_configure(gpio2, 4, GPIO_INPUT | GPIO_PULL_DOWN);
	if (rc < 0) {
		return rc;
	}

	return 0;
}

/*
 * Test #12 (2026-08-27) -- imu_vdd/LDO1 est un rail PARTAGE avec le
 * microphone PDM embarque (devicetree Seeed : "imu_vdd: dmic_vdd: LDO1").
 * Le peripherique pdm20 n'est jamais active (status="disabled" par
 * defaut, jamais touche -- hors perimetre du projet) : PDM_CLK (P1.13)
 * reste donc flottant des que imu_vdd alimente le micro. D'apres le
 * datasheet MSM261D3526H1CPM, seul VDD=0 V garantit un courant bas
 * (etat "Powered Down") -- sans horloge active/definie, rien ne
 * garantit le mode Sleep (1 uA typ) plutot qu'un mode actif indefini
 * (Low-Power typ 290 uA, tres proche du ~250-275 uA mesure). On force
 * ici PDM_CLK a un niveau bas defini (0 Hz stable, meme technique que
 * pour les broches SPI du flash externe) -- le micro n'est ni
 * configure ni utilise, seule sa broche d'horloge recoit un niveau
 * deterministe au lieu de flotter.
 *
 * Audit broches (2026-08-28) -- appel RETIRE D'URGENCE en meme temps que
 * le pull-down INT1 et la deconnexion NFC : les trois changements ont ete
 * mesures ENSEMBLE et ont produit un pic ~200 mA inedit. PDM est
 * probablement innocent (deja teste seul sans effet en test #12), mais
 * tant que ce n'est pas reconfirme isolement sur l'architecture actuelle,
 * l'appel reste retire par precaution -- voir
 * XIAO-nRF54LM20A-Solution-System-OFF.md. Fonction conservee mais non
 * appelee.
 */
static int configure_pdm_pins_for_system_off(void)
{
	const struct device *gpio1 = DEVICE_DT_GET(DT_NODELABEL(gpio1));
	int rc;

	if (!device_is_ready(gpio1)) {
		printf("GPIO1 not ready.\n");
		return -ENODEV;
	}

	rc = gpio_pin_configure(gpio1, 13, GPIO_OUTPUT_LOW); /* PDM_CLK */
	if (rc < 0) {
		return rc;
	}
	rc = gpio_pin_configure(gpio1, 14, GPIO_INPUT | GPIO_PULL_DOWN); /* PDM_DIN */
	if (rc < 0) {
		return rc;
	}

	return 0;
}

static int suspend_external_flash(void)
{
	int first_error = 0;
	int rc;

#if DT_NODE_HAS_STATUS(DT_NODELABEL(py25q64), okay)
	if (device_is_ready(flash_dev)) {
		rc = pm_device_action_run(flash_dev, PM_DEVICE_ACTION_SUSPEND);
		if ((rc < 0) && (first_error == 0)) {
			first_error = rc;
			printf("Warning: could not suspend external flash (%d)\n", rc);
		}
	} else {
		first_error = -ENODEV;
		printf("Warning: flash device is not ready; skipping driver DPD.\n");
	}

	if (device_is_ready(flash_bus)) {
		rc = pm_device_action_run(flash_bus, PM_DEVICE_ACTION_SUSPEND);
		if ((rc < 0) && (first_error == 0)) {
			first_error = rc;
			printf("Warning: could not suspend SPI bus (%d)\n", rc);
		}
	} else if (first_error == 0) {
		first_error = -ENODEV;
		printf("Warning: flash SPI bus is not ready.\n");
	}
#else
	first_error = -ENODEV;
	printf("Warning: py25q64 is not enabled in DTS.\n");
#endif

