thieryus007-cloud/xiao-door/nRF54LM20A/xiao_door_sensor/src/main.c
	rc = configure_spi_pins_for_system_off();
	if ((rc < 0) && (first_error == 0)) {
		first_error = rc;
		printf("Warning: could not configure flash SPI pins (%d)\n", rc);
	}

	return first_error;
}

/* --- Identite BLE fixe, inchangee -- reprise du firmware de production. --- */
static int set_fixed_ble_identity(void)
{
	bt_addr_le_t addr = { .type = BT_ADDR_LE_RANDOM };
	uint8_t hw_id[8];
	ssize_t len;

	len = hwinfo_get_device_id(hw_id, sizeof(hw_id));
	if (len < (ssize_t)sizeof(addr.a.val)) {
		printf("hwinfo device id too short (%d), using stack-generated address\n",
		       (int)len);
		return 0;
	}

	memcpy(addr.a.val, hw_id, sizeof(addr.a.val));
	addr.a.val[5] |= 0xC0;

	return bt_id_create(&addr, NULL);
}

/* --- Batterie : courbe LiPo non calibree, reprise du firmware de
 * production. --- */
static uint8_t voltage_to_percent(int32_t mv)
{
	static const struct {
		int32_t mv;
		uint8_t pct;
	} curve[] = {
		{ 4200, 100 }, { 4000, 80 }, { 3800, 55 }, { 3700, 35 },
		{ 3500, 15 },  { 3400, 5 },  { 3000, 0 },
	};

	if (mv >= curve[0].mv) {
		return curve[0].pct;
	}
	if (mv <= curve[ARRAY_SIZE(curve) - 1].mv) {
		return curve[ARRAY_SIZE(curve) - 1].pct;
	}
	for (size_t i = 0; i < ARRAY_SIZE(curve) - 1; i++) {
		if (mv <= curve[i].mv && mv >= curve[i + 1].mv) {
			int32_t span_mv = curve[i].mv - curve[i + 1].mv;
			int32_t span_pct = curve[i].pct - curve[i + 1].pct;

			return curve[i + 1].pct +
			       (uint8_t)((mv - curve[i + 1].mv) * span_pct / span_mv);
		}
	}
	return 0;
}

static int read_battery(uint8_t *out_pct, uint16_t *out_mv)
{
	struct sensor_value v;
	int ret;

	/* Test #29 (2026-08-28) -- init differee (voir overlay) : le driver
	 * chargeur n'ecrit ses ~12-15 transactions I2C de configuration que
	 * lorsqu'une lecture batterie est reellement demandee (health_due),
	 * plus a chaque demarrage. */
	if (!device_is_ready(charger_dev)) {
		ret = device_init(charger_dev);
		if (ret < 0 && ret != -EALREADY) {
			printf("Warning: charger device_init failed (%d)\n", ret);
			return ret;
		}
	}
	if (!device_is_ready(charger_dev)) {
		return -ENODEV;
	}
	ret = sensor_sample_fetch_chan(charger_dev, SENSOR_CHAN_GAUGE_VOLTAGE);
	if (ret < 0) {
		return ret;
	}
	ret = sensor_channel_get(charger_dev, SENSOR_CHAN_GAUGE_VOLTAGE, &v);
	if (ret < 0) {
		return ret;
	}

	*out_mv = (uint16_t)(v.val1 * 1000 + v.val2 / 1000);
	*out_pct = voltage_to_percent(*out_mv);
	return 0;
}

/* --- Etat retenu a travers un reset inattendu (watchdog/brownout) --
 * etendu le 2026-08-29 pour porter les trames A/C : derniers angles
 * envoyes (hysteresis), yaw integre (survit au reset comme sur l'ancien
 * firmware), echeance heartbeat en plus de l'echeance sante. RAM retenue,
 * CRC-validee comme l'exemple officiel Zephyr system_off. --- */
struct retained_state {
	uint8_t  bthome_pid;
	int16_t  last_sent_pitch_dd;
	int16_t  last_sent_roll_dd;
	int16_t  yaw_dd;             /* integration gyroscopique cumulee
				       * (dixiemes de degre) -- pas de recalage
				       * anti-derive, voir en-tete de fichier de
				       * l'ancien firmware de reference. */
	uint64_t next_health_us;     /* prochaine trame B, temps GRTC absolu */
	uint64_t next_heartbeat_us;  /* prochain heartbeat trame A, idem */
	uint32_t crc;
};

static struct retained_state retained;

#if DT_NODE_HAS_STATUS_OKAY(DT_ALIAS(retainedmemdevice))
static const struct device *const retained_dev = DEVICE_DT_GET(DT_ALIAS(retainedmemdevice));
#else
#error "retained_mem region not defined -- voir l'overlay de carte"
#endif

#define RETAINED_CRC_OFFSET offsetof(struct retained_state, crc)

static bool retained_load(void)
{
	uint32_t crc;

	if (retained_mem_read(retained_dev, 0, (uint8_t *)&retained, sizeof(retained)) != 0) {
		return false;
	}
	crc = crc32_ieee((const uint8_t *)&retained, RETAINED_CRC_OFFSET);
	return crc == retained.crc;
}

static void retained_save(void)
{
	retained.crc = crc32_ieee((const uint8_t *)&retained, RETAINED_CRC_OFFSET);
	retained_mem_write(retained_dev, 0, (uint8_t *)&retained, sizeof(retained));
}

static uint16_t clamp_u16(float scaled)
{
	if (scaled < 0.0f) {
		scaled = 0.0f;
	}
	if (scaled > (float)UINT16_MAX) {
		scaled = (float)UINT16_MAX;
	}
	return (uint16_t)scaled;
}

static int16_t clamp_i16(float scaled)
{
	if (scaled < (float)INT16_MIN) {
		scaled = (float)INT16_MIN;
	}
	if (scaled > (float)INT16_MAX) {
		scaled = (float)INT16_MAX;
	}
	return (int16_t)scaled;
}

static int32_t clamp_i32(double scaled)
{
	if (scaled < (double)INT32_MIN) {
		scaled = (double)INT32_MIN;
	}
	if (scaled > (double)INT32_MAX) {
		scaled = (double)INT32_MAX;
	}
	return (int32_t)scaled;
}

struct imu_sample {
	float ax, ay, az;
	bool valid;
};

/* Temperature interne : suit l'ODR de l'accelerometre (deja actif dans la
 * meme fenetre imu_vdd), fetch separe (registres distincts) -- appele
 * uniquement quand une trame B va etre envoyee (health_due), voir
 * sample_motion(), pour ne pas payer cette transaction I2C supplementaire
 * a chaque cycle de 1s. */
static int read_die_temp(int16_t *temp_cc)
{
	struct sensor_value t;

	if (sensor_sample_fetch_chan(imu_dev, SENSOR_CHAN_DIE_TEMP) == 0 &&
	    sensor_channel_get(imu_dev, SENSOR_CHAN_DIE_TEMP, &t) == 0) {
		*temp_cc = clamp_i16(sensor_value_to_float(&t) * 100.0f);
		return 0;
	}
	*temp_cc = 0;
	return -EIO;
}

/* Delai avant lecture gyro : bug corrige le 2026-08-30 sur l'ancien
 * firmware (jamais mesure avant ce jour) -- le driver Zephyr lsm6dsl lit
 * les registres de sortie gyro directement, sans attendre le drapeau
 * "donnee prete". Ton (temps de demarrage) = 35 ms (datasheet ST
 * DocID030071 Rev 3 Table 4 p.24) ; 35 + 80 (premiere periode ODR a
 * 12,5 Hz) ~= 115 ms minimum -- marge portee a 200 ms (~2,5 periodes ODR). */
#define GYRO_STARTUP_MS 200

static void set_gyro_power(bool on)
{
	struct sensor_value odr_attr = { .val1 = on ? 12 : 0, .val2 = on ? 500000 : 0 };

	sensor_attr_set(imu_dev, SENSOR_CHAN_GYRO_XYZ, SENSOR_ATTR_SAMPLING_FREQUENCY, &odr_attr);
	if (on) {
		k_msleep(GYRO_STARTUP_MS);
	}
}

static int read_gyro_burst(float *gx, float *gy, float *gz)
{
	struct sensor_value x, y, z;
	int ret;

	set_gyro_power(true);

