thieryus007-cloud/xiao-door/nRF54LM20A/xiao_door_sensor/src/main.c
	ret = sensor_sample_fetch_chan(imu_dev, SENSOR_CHAN_GYRO_XYZ);
	if (ret < 0) {
		set_gyro_power(false);
		return ret;
	}
	sensor_channel_get(imu_dev, SENSOR_CHAN_GYRO_X, &x);
	sensor_channel_get(imu_dev, SENSOR_CHAN_GYRO_Y, &y);
	sensor_channel_get(imu_dev, SENSOR_CHAN_GYRO_Z, &z);
	*gx = sensor_value_to_float(&x) * RAD_TO_DEG;
	*gy = sensor_value_to_float(&y) * RAD_TO_DEG;
	*gz = sensor_value_to_float(&z) * RAD_TO_DEG;

	set_gyro_power(false);
	return 0;
}

/* Horodatage de la derniere integration yaw -- volontairement en RAM non
 * retenue (remise a 0 a chaque boot) : la valeur integree elle-meme
 * (retained.yaw_dd) survit a un reset inattendu, mais le delta de temps
 * entre deux lectures gyro ne doit etre calcule qu'au sein d'une meme
 * session. */
static int64_t last_yaw_update_uptime;

static int read_gyro_and_integrate_yaw(float *gx, float *gy, float *gz, uint16_t *gyro_mag)
{
	int gyro_ret = read_gyro_burst(gx, gy, gz);

	*gyro_mag = 0;
	if (gyro_ret == 0) {
		*gyro_mag = clamp_u16(sqrtf(*gx * *gx + *gy * *gy + *gz * *gz) * 1000.0f);

		int64_t now = k_uptime_get();

		if (last_yaw_update_uptime != 0) {
			float dt_s = (float)(now - last_yaw_update_uptime) / 1000.0f;

			retained.yaw_dd = clamp_i16((float)retained.yaw_dd + *gz * dt_s * 10.0f);
		}
		last_yaw_update_uptime = now;
	}
	return gyro_ret;
}

static bool motion_detected(const struct imu_sample *prev, const struct imu_sample *cur)
{
	float dx, dy, dz, delta_mag;

	if (!prev->valid) {
		return false;
	}
	dx = cur->ax - prev->ax;
	dy = cur->ay - prev->ay;
	dz = cur->az - prev->az;
	delta_mag = sqrtf(dx * dx + dy * dy + dz * dz);

	return delta_mag > MOTION_THRESHOLD_MS2;
}

/* Pitch/roll par projection du vecteur gravite. */
static void accel_to_pitch_roll(float ax, float ay, float az,
				  int16_t *pitch_dd, int16_t *roll_dd)
{
	float pitch = atan2f(-ax, sqrtf(ay * ay + az * az)) * RAD_TO_DEG;
	float roll  = atan2f(ay, az) * RAD_TO_DEG;

	*pitch_dd = clamp_i16(pitch * 10.0f);
	*roll_dd  = clamp_i16(roll * 10.0f);
}

static int init_button(void)
{
	if (!device_is_ready(button.port)) {
		return -ENODEV;
	}
	return gpio_pin_configure_dt(&button, GPIO_INPUT);
}

static uint8_t read_button_state(void)
{
	int val = gpio_pin_get_dt(&button);

	if (val < 0) {
		printf("Warning: button read failed (%d)\n", val);
		return 0;
	}
	return (uint8_t)val;
}

/* --- Trame A : evenement + orientation. --- */
static uint8_t frame_a[] = {
	BTHOME_UUID_LO, BTHOME_UUID_HI, BTHOME_INFO_TRIG,
	OBJ_PACKET_ID, 0x00,
	OBJ_GENERIC_BOOL, 0x00,
	OBJ_MOTION, 0x00,
	OBJ_TAMPER, 0x00,
	OBJ_VIBRATION, 0x00,
	OBJ_BUTTON, 0x00,
	OBJ_ROTATION, 0x00, 0x00,
	OBJ_ROTATION, 0x00, 0x00,
	OBJ_ROTATION, 0x00, 0x00,
};
#define A_OFF_PACKET_ID  4
#define A_OFF_ACTIVITY   6
#define A_OFF_MOTION     8
#define A_OFF_TAMPER     10
#define A_OFF_VIBRATION  12
#define A_OFF_BUTTON     14
#define A_OFF_PITCH      16
#define A_OFF_ROLL       19
#define A_OFF_YAW        22

/* --- Trame B : sante periodique + nom. --- */
static uint8_t frame_b[] = {
	BTHOME_UUID_LO, BTHOME_UUID_HI, BTHOME_INFO_TRIG,
	OBJ_PACKET_ID, 0x00,
	OBJ_BATTERY, 0x00,
	OBJ_TEMPERATURE, 0x00, 0x00,
	OBJ_VOLTAGE, 0x00, 0x00,
	OBJ_BATTERY_LOW, 0x00,
};
#define B_OFF_PACKET_ID 4
#define B_OFF_BATTERY   6
#define B_OFF_TEMP      8
#define B_OFF_VOLTAGE   11
#define B_OFF_BATT_LOW  14

/* --- Trame C : IMU brut, magnitudes + acceleration signee par axe.
 * Budget serre : 31 octets sur l'air exactement (calcul verifie contre
 * zephyr/subsys/bluetooth/host/adv.c:495, BT_GAP_ADV_MAX_ADV_DATA_LEN) --
 * plus aucune marge, toute mesure supplementaire ajoutee ici fera echouer
 * l'advertising. --- */
static uint8_t frame_c[] = {
	BTHOME_UUID_LO, BTHOME_UUID_HI, BTHOME_INFO_TRIG,
	OBJ_PACKET_ID, 0x00,
	OBJ_ACCELERATION, 0x00, 0x00,
	OBJ_GYROSCOPE, 0x00, 0x00,
	OBJ_ACCEL_SIGNED, 0x00, 0x00, 0x00, 0x00,
	OBJ_ACCEL_SIGNED, 0x00, 0x00, 0x00, 0x00,
	OBJ_ACCEL_SIGNED, 0x00, 0x00, 0x00, 0x00,
};
#define C_OFF_PACKET_ID  4
#define C_OFF_ACCEL_MAG  6
#define C_OFF_GYRO_MAG   9   /* pas 8 : l'octet 8 est l'ID de l'objet gyro */
#define C_OFF_ACCEL_X    12
#define C_OFF_ACCEL_Y    17
#define C_OFF_ACCEL_Z    22

static struct bt_data frame_a_ad[] = {
	BT_DATA_BYTES(BT_DATA_FLAGS, BT_LE_AD_NO_BREDR),
	BT_DATA(BT_DATA_SVC_DATA16, frame_a, sizeof(frame_a)),
};
static struct bt_data frame_b_ad[] = {
	BT_DATA_BYTES(BT_DATA_FLAGS, BT_LE_AD_NO_BREDR),
	BT_DATA(BT_DATA_NAME_COMPLETE, CONFIG_BT_DEVICE_NAME, sizeof(CONFIG_BT_DEVICE_NAME) - 1),
	BT_DATA(BT_DATA_SVC_DATA16, frame_b, sizeof(frame_b)),
};
static struct bt_data frame_c_ad[] = {
	BT_DATA_BYTES(BT_DATA_FLAGS, BT_LE_AD_NO_BREDR),
	BT_DATA(BT_DATA_SVC_DATA16, frame_c, sizeof(frame_c)),
};

static void advertise_burst(struct bt_data *data, size_t data_len)
{
	int err;

	err = bt_le_adv_start(BT_LE_ADV_NCONN_IDENTITY, data, data_len, NULL, 0);
	if (err) {
		printf("Advertising failed to start (err %d)\n", err);
		return;
	}
	k_msleep(ADV_BURST_MS);
	err = bt_le_adv_stop();
	if (err) {
		printf("Advertising failed to stop (err %d)\n", err);
	}
}

/* Fenetre glissante simple : au plus FRAME_A_MAX_PER_MIN trames A envoyees
 * sur les 60 dernieres secondes. Volontairement non retenue entre deux
 * boots -- etat de session uniquement. */
static int64_t frame_a_send_times[FRAME_A_MAX_PER_MIN];
static size_t frame_a_send_idx;

static bool frame_a_rate_limited(int64_t now)
{
	int64_t oldest = frame_a_send_times[frame_a_send_idx];

	return (oldest != 0) && (now - oldest) < 60000;
}

static void frame_a_record_send(int64_t now)
{
	frame_a_send_times[frame_a_send_idx] = now;
	frame_a_send_idx = (frame_a_send_idx + 1) % FRAME_A_MAX_PER_MIN;
}

static void send_frame_a(const struct imu_sample *accel, bool motion, bool activity,
			   const char *reason)
{
	int16_t pitch_dd, roll_dd;

	accel_to_pitch_roll(accel->ax, accel->ay, accel->az, &pitch_dd, &roll_dd);

	retained.bthome_pid++;
	frame_a[A_OFF_PACKET_ID] = retained.bthome_pid;
	frame_a[A_OFF_ACTIVITY] = activity ? 1 : 0;
	frame_a[A_OFF_MOTION] = motion ? 1 : 0;
	frame_a[A_OFF_TAMPER] = 0;    /* free-fall : non implemente, driver LSM6DSL
				       * n'expose pas cet evenement via sensor_trigger */
	frame_a[A_OFF_VIBRATION] = 0; /* double-tap : non implemente, idem */
	frame_a[A_OFF_BUTTON] = read_button_state();
	sys_put_le16((uint16_t)pitch_dd, &frame_a[A_OFF_PITCH]);
	sys_put_le16((uint16_t)roll_dd, &frame_a[A_OFF_ROLL]);
	sys_put_le16((uint16_t)retained.yaw_dd, &frame_a[A_OFF_YAW]);

	printf("trame A (%s) #%u: pitch=%d.%d roll=%d.%d motion=%d activity=%d\n",
	       reason, retained.bthome_pid, pitch_dd / 10, abs(pitch_dd % 10),
	       roll_dd / 10, abs(roll_dd % 10), motion, activity);

	advertise_burst(frame_a_ad, ARRAY_SIZE(frame_a_ad));
}

/* La trame qui rapporte l'etat actuel (plus de mouvement) apres un
 * mouvement est la seule dont la perte laisse HA fige dans un etat perime
 * pendant longtemps. BLE non connecte (advertising) n'a pas d'accuse de
 * reception : on repete donc cette trame precise plusieurs fois, chacune
 * avec un packet_id different, pour rendre sa perte totale hautement
 * improbable. */
#define FINAL_STATE_REPEATS       3
#define FINAL_STATE_REPEAT_GAP_MS 3000

static void send_final_state_frame(const struct imu_sample *cur, const char *reason)
{
	for (int i = 0; i < FINAL_STATE_REPEATS; i++) {
		if (i > 0) {
			k_msleep(FINAL_STATE_REPEAT_GAP_MS);
		}
		send_frame_a(cur, false, false, reason);
		frame_a_record_send(k_uptime_get());
	}
}

static void send_frame_c(const struct imu_sample *accel, int gyro_ret, float gx, float gy,
			   float gz, uint16_t gyro_mag)
{
	uint16_t accel_mag = clamp_u16(
		sqrtf(accel->ax * accel->ax + accel->ay * accel->ay + accel->az * accel->az) *
		1000.0f);

	printf("trame C: gyro_ret=%d gyro_mag=%u accel_mag_x1000=%u\n",
	       gyro_ret, gyro_mag, accel_mag);

