thieryus007-cloud/xiao-door/nRF54LM20A/xiao_door_sensor/src/main.c
	/* Packet ID propre, distinct de celui de la trame A qui la precede :
	 * deux trames differentes portant le meme id a moins de 4s
	 * d'intervalle sont indiscernables d'une retransmission pour le
	 * deduplicateur BTHome -- la seconde serait silencieusement ecartee
	 * par HA. */
	retained.bthome_pid++;
	frame_c[C_OFF_PACKET_ID] = retained.bthome_pid;
	sys_put_le16(accel_mag, &frame_c[C_OFF_ACCEL_MAG]);
	sys_put_le16(gyro_mag, &frame_c[C_OFF_GYRO_MAG]);
	sys_put_le32((uint32_t)clamp_i32((double)accel->ax * 1000000.0), &frame_c[C_OFF_ACCEL_X]);
	sys_put_le32((uint32_t)clamp_i32((double)accel->ay * 1000000.0), &frame_c[C_OFF_ACCEL_Y]);
	sys_put_le32((uint32_t)clamp_i32((double)accel->az * 1000000.0), &frame_c[C_OFF_ACCEL_Z]);

	advertise_burst(frame_c_ad, ARRAY_SIZE(frame_c_ad));
}

static void send_frame_b(int16_t temp_cc)
{
	uint8_t battery_pct = 0;
	uint16_t battery_mv = 0;

	if (read_battery(&battery_pct, &battery_mv) < 0) {
		printf("battery read failed, sending frame B without a fresh value\n");
	}

	retained.bthome_pid++;
	frame_b[B_OFF_PACKET_ID] = retained.bthome_pid;
	frame_b[B_OFF_BATTERY] = battery_pct;
	sys_put_le16((uint16_t)temp_cc, &frame_b[B_OFF_TEMP]);
	sys_put_le16(battery_mv, &frame_b[B_OFF_VOLTAGE]);
	frame_b[B_OFF_BATT_LOW] = battery_pct < 15 ? 1 : 0;

	printf("trame B #%u: battery=%u%% (%u mV) temp=%d.%02d C\n",
	       retained.bthome_pid, battery_pct, battery_mv,
	       temp_cc / 100, abs(temp_cc % 100));

	advertise_burst(frame_b_ad, ARRAY_SIZE(frame_b_ad));
}

static uint64_t next_health_deadline(uint64_t from_us)
{
	return from_us + ((uint64_t)FRAME_B_INTERVAL_MS * 1000);
}

static uint64_t next_heartbeat_deadline(uint64_t from_us)
{
	return from_us + ((uint64_t)FRAME_A_HEARTBEAT_MS * 1000);
}

/* --- Resultat d'un cycle de sondage IMU : accelerometre systematique,
 * temperature/gyroscope seulement si demandes (want_temp / evenement a
 * rapporter) -- tout est lu dans la MEME fenetre imu_vdd, avant que
 * sample_motion() ne coupe le rail, pour ne jamais payer un second
 * cycle regulateur/I2C. --- */
struct motion_result {
	struct imu_sample accel;
	int16_t temp_cc;
	bool temp_valid;
	int16_t pitch_dd, roll_dd;
	bool moving;
	bool angle_crossed;
	bool want_event_frame;
	bool rate_limited;
	int64_t now;
	bool gyro_read;
	int gyro_ret;
	float gx, gy, gz;
	uint16_t gyro_mag;
};

/* Allume imu_vdd, reecrit CTRL3_C/CTRL6_C (voir commentaire d'en-tete de
 * fichier -- necessaire a CHAQUE cycle : imu_vdd est coupe puis rallume a
 * chaque appel, ce qui remet la puce a son etat de reset materiel, mais
 * device_init() ne re-executera plus jamais lsm6dsl_init_chip() une fois
 * le driver marque initialise), initialise le driver LSM6DSL une seule
 * fois (deferred-init, voir overlay), lit accelerometre (+ temperature si
 * want_temp, + gyroscope en rafale si un evenement va etre rapporte), puis
 * eteint imu_vdd avant tout appel BLE (advertise_burst() peut bloquer
 * jusqu'a ~700ms-~10s -- hors de question de laisser imu_vdd allume
 * pendant ce temps). Ne modifie jamais WK_THS/WAKE_UP_THS -- lecture
 * directe des axes via l'API sensor standard, aucune configuration
 * d'interruption materielle (plus de reveil GPIO dans cette architecture,
 * voir en-tete de fichier). */

/* Etape C (2026-09-22, plan #8.4) -- imu_vdd/LDO1 commande par front sur
 * P1.25 (GPIO0 nPM1300) au lieu des ecritures I2C bit-bang
 * TASKLDSW1SET/CLR. Pas de lecture I2C "errata [38]" apres le front :
 * caracterisation xiao_ldo_gpio_char (20 essais/variante) a montre que
 * le front seul (V1) est deja fiable (20/20 WHO_AM_I OK) et plus rapide
 * que les variantes avec lecture (V2/V3) -- cas anticipe au plan §8.3
 * (« si V1 est deja rapide : pas de lecture du tout »). */
static int imu_rail_on(void)
{
	return regulator_parent_dvs_state_set(pmic_regs, 1);
}

static void imu_rail_off(void)
{
	(void)regulator_parent_dvs_state_set(pmic_regs, 0);
}

static int sample_motion(struct imu_sample *prev, bool heartbeat_pending, bool want_temp,
			   int64_t last_frame_a_uptime, struct motion_result *out)
{
	int rc;

	memset(out, 0, sizeof(*out));

	rc = imu_rail_on();
	if (rc < 0) {
		printf("Warning: imu_rail_on failed (%d)\n", rc);
		return rc;
	}

	/* Soft-start LDO nPM1300 (datasheet Table 24 : 1,8 ms typique) --
	 * marge ~2,8x, voir test #32. */
	k_msleep(5);

	if (!device_is_ready(imu_dev)) {
		rc = device_init(imu_dev);
		if (rc < 0 && rc != -EALREADY) {
			printf("Warning: IMU device_init failed (%d)\n", rc);
			imu_rail_off();
			return rc;
		}
	}

	/* Une seule ecriture, auto-increment (IF_INC=1 des le reset) :
	 * CTRL3_C, CTRL4_C, CTRL5_C, CTRL6_C. */
	uint8_t ctrl3_6[5] = {
		LSM6DSL_REG_CTRL3_C,
		LSM6DSL_CTRL3_C_BDU | LSM6DSL_CTRL3_C_H_LACTIVE | LSM6DSL_CTRL3_C_IF_INC, /* 0x64 */
		0x00,                       /* CTRL4_C : reset */
		0x00,                       /* CTRL5_C : reset */
		LSM6DSL_CTRL6_C_XL_HM_MODE, /* 0x10 : mode normal (comme aujourd'hui) */
	};
	rc = i2c_write_dt(&imu_i2c, ctrl3_6, sizeof(ctrl3_6));
	if (rc < 0) {
		printf("Warning: IMU CTRL3_6 burst write failed (%d)\n", rc);
		imu_rail_off();
		return rc;
	}
	/* Puis l'ODR, APRES XL_HM_MODE (pas de passage transitoire en HP). */
	rc = i2c_reg_write_byte_dt(&imu_i2c, LSM6DSL_REG_CTRL1_XL, CTRL1_XL_208HZ_2G);
	if (rc < 0) {
		printf("Warning: IMU CTRL1_XL write failed (%d)\n", rc);
		imu_rail_off();
		return rc;
	}
	/* Periode reelle a 208 Hz = ~4,8 ms -- 6 ms garde une marge ~1,2 ms. */
	k_msleep(6);

	uint8_t raw[6];
	rc = i2c_burst_read_dt(&imu_i2c, LSM6DSL_REG_OUTX_L_XL, raw, sizeof(raw));
	if (rc < 0) {
		printf("Warning: IMU XYZ burst read failed (%d)\n", rc);
		imu_rail_off();
		return rc;
	}
	out->accel.ax = (int16_t)sys_get_le16(&raw[0]) * ACCEL_MS2_PER_LSB;
	out->accel.ay = (int16_t)sys_get_le16(&raw[2]) * ACCEL_MS2_PER_LSB;
	out->accel.az = (int16_t)sys_get_le16(&raw[4]) * ACCEL_MS2_PER_LSB;
	out->accel.valid = true;

	if (want_temp) {
		out->temp_valid = (read_die_temp(&out->temp_cc) == 0);
	}

	accel_to_pitch_roll(out->accel.ax, out->accel.ay, out->accel.az,
			     &out->pitch_dd, &out->roll_dd);
	out->moving = motion_detected(prev, &out->accel);
	out->angle_crossed =
		(abs(out->pitch_dd - retained.last_sent_pitch_dd) > ANGLE_HYSTERESIS_DD) ||
		(abs(out->roll_dd - retained.last_sent_roll_dd) > ANGLE_HYSTERESIS_DD);

	out->now = k_uptime_get();

	bool min_gap_ok = (out->now - last_frame_a_uptime) >= MOTION_REPORT_MIN_GAP_MS;

	out->want_event_frame =
		heartbeat_pending || ((out->moving || out->angle_crossed) && min_gap_ok);
	out->rate_limited = frame_a_rate_limited(out->now);

	if (out->want_event_frame && !out->rate_limited) {
		out->gyro_ret = read_gyro_and_integrate_yaw(&out->gx, &out->gy, &out->gz,
							      &out->gyro_mag);
		out->gyro_read = true;
	}

