thieryus007-cloud/xiao-door/nRF54LM20A/xiao_door_sensor/src/main.c
	imu_rail_off();

	/* Audit broches (2026-08-28) -- pull-down sur INT1 (gpio0.6) TENTE
	 * puis RETIRE D'URGENCE : mesure PPK2 a montre un pic ~200 mA,
	 * jamais observe avant sur ce projet. Code retire par securite --
	 * voir XIAO-nRF54LM20A-Solution-System-OFF.md, ne pas retenter sans
	 * comprendre le mecanisme exact. */

	return 0;
}

int main(void)
{
	int rc;
	uint32_t reset_cause = 0U;

	printf("\n=== %s ultra-low-power system-on-idle (GRTC+RAM+BLE+IMU) ===\n", CONFIG_BOARD);

	rc = hwinfo_get_reset_cause(&reset_cause);
	if (rc == 0) {
		print_reset_cause(reset_cause);
	} else {
		printf("Warning: could not read reset cause (%d)\n", rc);
	}
	hwinfo_clear_reset_cause();

	/* Plus de reboot periodique -- retained_load() ne sert plus qu'a
	 * survivre a un reset inattendu (watchdog, brownout), pas au
	 * fonctionnement normal. */
	if (!retained_load()) {
		memset(&retained, 0, sizeof(retained));
	}

	/* Correctif 2026-08-29 : la RAM retenue est de la SRAM ordinaire (pas
	 * de la RRAM) -- elle peut survivre a un reset/reflash (CRC valide)
	 * alors que le compteur GRTC, lui, repart de zero. Une echeance
	 * absolue chargee d'une session precedente (ex. plusieurs heures de
	 * fonctionnement) deviendrait alors inatteignable pendant une duree
	 * indeterminee, empechant toute trame B/heartbeat de partir --
	 * symptome observe le 2026-08-29 sur l'unite #01 (aucune trame en
	 * 18 min apres reflash). On borne les deux echeances a au plus un
	 * intervalle complet apres CE boot, jamais plus loin. */
	uint64_t boot_us = z_nrf_grtc_timer_read();
	uint64_t max_health_deadline = next_health_deadline(boot_us);
	uint64_t max_heartbeat_deadline = next_heartbeat_deadline(boot_us);

	if (retained.next_health_us > max_health_deadline) {
		retained.next_health_us = max_health_deadline;
	}
	if (retained.next_heartbeat_us > max_heartbeat_deadline) {
		retained.next_heartbeat_us = max_heartbeat_deadline;
	}

	release_led_gpios();

	/* Etape C (plan #8.4) -- force LDO1 a l'arret une fois au demarrage :
	 * les registres du nPM1300 survivent a un reset du SoC, donc un
	 * reset laissant le rail actif (front P1.25 haut) ne le coupe pas
	 * tout seul sinon. */
	(void)mfd_npm13xx_reg_write(pmic_dev, NPM13XX_LDSW_BASE, NPM13XX_LDSW_TASK1CLR, 1);

	/* Configuration une seule fois au vrai demarrage : les broches SPI
	 * externes et l'identite/pile BLE n'ont plus besoin d'etre
	 * reconfigurees a chaque cycle puisque le SoC ne redemarre plus. */
	rc = configure_spi_pins_for_system_off();
	if (rc < 0) {
		printf("Warning: could not configure flash SPI pins (%d)\n", rc);
	}

	rc = init_button();
	if (rc < 0) {
		printf("Warning: button init failed (%d) -- bouton toujours envoye a 0\n", rc);
	}

	rc = set_fixed_ble_identity();
	if (rc < 0) {
		printf("Warning: could not set fixed BLE identity (err %d)\n", rc);
	}

	rc = bt_enable(NULL);
	if (rc) {
		printf("Error: Bluetooth init failed (err %d), reboot\n", rc);
		sys_reboot(SYS_REBOOT_COLD);
	}

	printf("Bluetooth initialized once -- reset_cause=0x%08x\n", reset_cause);

	/* Coupe les sections RAM inutilisees pendant le System ON IDLE.
	 * Appele une seule fois, apres toute l'init qui pourrait avoir
	 * besoin de RAM (BLE/MPSL inclus). */
	power_down_unused_ram();

	struct imu_sample prev = { .valid = false };
	bool was_moving = false;
	int64_t rest_since = 0;
	int64_t first_moving_uptime = 0;
	bool rest_frame_pending = false;
	int64_t last_frame_a_uptime = -(int64_t)MOTION_REPORT_MIN_GAP_MS;

	while (1) {
		uint64_t now_us = z_nrf_grtc_timer_read();
		bool health_due = now_us >= retained.next_health_us;
		bool heartbeat_due = now_us >= retained.next_heartbeat_us;
		struct motion_result mr;

		rc = sample_motion(&prev, heartbeat_due, health_due, last_frame_a_uptime, &mr);
		if (rc < 0) {
			printf("Warning: sample_motion failed (%d)\n", rc);
			k_sleep(K_MSEC(MOTION_POLL_INTERVAL_MS));
			continue;
		}

		prev = mr.accel;

		if (mr.want_event_frame && !mr.rate_limited) {
			const char *reason = heartbeat_due ? "heartbeat" :
					      mr.moving ? "motion" : "angle";

			send_frame_a(&mr.accel, mr.moving, mr.moving, reason);
			send_frame_c(&mr.accel, mr.gyro_read ? mr.gyro_ret : -EIO,
				     mr.gx, mr.gy, mr.gz, mr.gyro_mag);
			frame_a_record_send(mr.now);
			last_frame_a_uptime = mr.now;
			retained.last_sent_pitch_dd = mr.pitch_dd;
			retained.last_sent_roll_dd = mr.roll_dd;
			if (heartbeat_due) {
				retained.next_heartbeat_us =
					next_heartbeat_deadline(z_nrf_grtc_timer_read());
			}
		}

		if (mr.moving) {
			was_moving = true;
			rest_since = 0;
			rest_frame_pending = false;
			if (first_moving_uptime == 0) {
				first_moving_uptime = mr.now;
			}
		} else if (was_moving) {
			if (rest_since == 0) {
				rest_since = mr.now;
			} else if (!rest_frame_pending &&
				   ((mr.now - rest_since) >= REST_FRAME_DELAY_MS ||
				    (first_moving_uptime != 0 &&
				     (mr.now - first_moving_uptime) >= REST_FRAME_MAX_WAIT_MS))) {
				/* La trame "repos" n'est jamais bloquee par le
				 * plafond anti-rafale : c'est le signal de
				 * retour au calme, le bloquer laisserait HA
				 * fige sur "Detecte". */
				send_final_state_frame(&mr.accel, "repos");
				last_frame_a_uptime = k_uptime_get();
				first_moving_uptime = 0;
				was_moving = false;
				rest_since = 0;
				rest_frame_pending = true;
			}
		}

		if (health_due) {
			send_frame_b(mr.temp_valid ? mr.temp_cc : 0);
			retained.next_health_us = next_health_deadline(z_nrf_grtc_timer_read());
		}

		/* RAM ordinaire (pas RRAM) : cout d'ecriture negligeable, pas
		 * de souci d'usure -- sauvegarde a chaque cycle plutot que de
		 * suivre precisement quel champ a change (yaw/pitch/roll/
		 * heartbeat/pid peuvent tous evoluer independamment). */
		retained_save();

		k_sleep(K_MSEC(MOTION_POLL_INTERVAL_MS));
	}

	return 0;
}
